brew "zoxide" # cd replacement
brew "eza" # ls replacement
brew "fzf" # fuzzy finder
brew "bat" # cat replacement
brew "ripgrep" # grep replacement
brew "starship"
brew "dust" # disk usage
brew "procs" # ps replacement
brew "fd" # find replacement
brew "awscli"
brew "coreutils" # gnu core utilities
brew "git"
brew "go"
brew "gpg"
brew "bottom" # htop replacement
brew "httpie" # curl replacement
brew "imagemagick" # image processing
brew "jp2a" # ascii art from images
brew "jq" # json processor
brew "libgit2"
brew "mas" # mac app store cli
brew "mise" # runtime version manager (replaces nvm + pyenv)
brew "atuin" # shell history replacement
brew "zsh-autosuggestions" # fish-like ghost text suggestions
brew "zsh-fast-syntax-highlighting" # real-time command colorization
brew "fzf-tab" # fzf-powered tab completion
brew "pinentry-mac" # pinentry for gpg
brew "wget" # wget
brew "pnpm" # npm replacement
brew "neovim" # vim replacement
brew "git-delta" # git delta
brew "duti" # set default apps per file type
cask "visual-studio-code"
cask "1password"
cask "obsidian"
cask "google-drive"
cask "firefox"
cask "font-victor-mono"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "font-jetbrains-mono"
cask "keycastr"
cask "notion"
cask "signal"
cask "slack"
cask "spotify"
cask "zoom"
cask "discord"
cask "tradingview"
cask "raycast"
cask "ghostty" # New Terminal
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
