tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
cask "xquartz"
brew "ack"
brew "readline"
brew "awscli"
brew "bat"
brew "cocoapods"
brew "coreutils"
brew "crystal"
brew "exa"
brew "git"
brew "go"
brew "grc"
brew "htop"
brew "httpie"
brew "hugo"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "jp2a"
brew "jq"
brew "libcaca"
brew "libgit2"
brew "libxmlsec1"
brew "llvm"
brew "mas"
brew "mysql"
brew "nvm"
brew "postgresql", restart_service: true
brew "postgresql@9.6"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "roundup"
brew "spaceman-diff"
brew "spark"
brew "terraform"
brew "tmux"
brew "tmux-cssh"
brew "unrar"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
cask "1password"
cask "atom"
cask "brave"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-inconsolatalgc-nerd-font"
cask "font-victor-mono"
cask "google-chrome"
cask "gpgtools"
cask "iterm2"
cask "java"
cask "jetbrains-toolbox"
cask "keybase"
cask "keycastr"
cask "pycharm"
cask "screenhero"
cask "sequel-pro"
cask "signal"
cask "slack"
cask "spotify"
cask "virtualbox"
cask "vlc"
cask "webstorm"
mas "Amphetamine", id: 937984704
mas "Frank DeLoupe", id: 530458789
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
