tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
<<<<<<< HEAD

=======
>>>>>>> dde603f (cleanup)
cask "xquartz"

brew "ack"
brew "awscli"
brew "bat"
brew "coreutils"
brew "exa"
brew "fd"
brew "git"
brew "go"
brew "grc"
brew "gpg"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jp2a"
brew "jq"
brew "libgit2"
brew "libxmlsec1"
brew "mas"
brew "nvm"
brew "pineentry-mac"
brew "postgresql", restart_service: true
brew "ripgrep"
brew "spaceman-diff"
brew "spark"
brew "unrar"
brew "vim"
brew "wget"
cask "visual-studio-code"
brew "yarn"
cask "1password"
cask "dropbox"
cask "firefox"
cask "font-victor-mono"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keycastr"
cask "signal"
cask "slack"
cask "spotify"
cask "vlc"
cask "webstorm"
mas "Amphetamine", id: 937984704
mas "Frank DeLoupe", id: 530458789
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
